app/Controllers/DosenAPIController.php

SELECT *
FROM `dosen`
ORDER BY `nip` DESC
---
    public function index()
    {
        $model = new dosenmodel();
        $data['dosen'] = $model->orderBy('nip', 'DESC')->findAll();

UPDATE `dosen` SET `name` = 'andi', `email` = 'aaa@asa.com', `phone` = '98393422', `address` = 'asdfsfsg'
WHERE `dosen`.`nip` IN ('3')
---
    public function update($id = null)
    {
        $model = new dosenmodel();
        $json = $this->request->getJSON();
        if($json){
            $data = [
                'name' => $json->name,
                'email' => $json->email,
                'phone' => $json->phone,
                'address'=> $json->address,
            ];
        }else{
            $input = $this->request->getRawInput();
            $data = [
                'name' => $this->request->getPost['name'],
                'email' => $this->request->getPost['email'],
                'phone' => $this->request->getPost['phone'],
                'address'=> $this->request->getPost['address']
            ];
        }
        $model->update($id, $data);