app/Controllers/DosenController.php

    public function index()
    {
	$data['Dosen'] = $this->Dosen->findAll();
---
SELECT *
FROM `dosen`

    public function edit($nip)
    {

        $this->Dosen->update($nip, [
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'phone' => $this->request->getPost('phone'),
                'address' => $this->request->getPost('address'),
            ]);
---
UPDATE `dosen` SET `name` = 'asas', `email` = 'adasasa@asa.com', `phone` = '983934342333444', `address` = 'asdfsfsg'
WHERE `dosen`.`nip` IN ('172028018201002')