app/Controllers/RevisionController.php

    public function index()
    {
        $model = new Revision();
        $data['revision'] = $model->orderBy('id_revisi', 'DESC')->findAll();
---
SELECT *
FROM `revision`
ORDER BY `id_revisi` DESC

    public function create()
    {
        $model = new Revision();
        $data = [
            'id_Revisi'=> $this->request->getVar('id_Revisi'),
            'MHS_nrp' => $this->request->getVar('MHS_nrp'),
            'dosen_nip' => $this->request->getVar('dosen_nip'),
            'TA_id' => $this->request->getVar('TA_id'),
            'Status' => $this->request->getVar('Status'),
            'Ket_revisi' => $this->request->getVar('Ket_revisi'),
        ];
        $model->insert($data);
---
INSERT INTO `revision` (`MHS_nrp`, `dosen_nip`, `TA_id`, `Status`, `Ket_revisi`) VALUES ('2', '3', '3', 'Disetujui', 'dapat diproses')

    public function show($id = null)
    {
        $model = new Revision();
        $data = $model->getWhere(['id_Revisi'=> $id])->getResult();
---
SELECT *
FROM `revision`
WHERE `id_Revisi` = '1'