app/Controllers/RevisiController.php

SELECT *
FROM `revision`
---
    public function index()
    {
	$data['Revision'] = $this->Revision->findAll();